package com.report.ware;

import java.util.List;
import java.util.Map;

//-----------------------------------------------------
// [BoardService 인터페이스] 선언
//-----------------------------------------------------
public interface BoardService {
	//-----------------------------------------------------
	// [게시판 글 입력 후 입력 적용 행의 개수] 리턴하는 메소드 선언
	//-----------------------------------------------------
	int insertBoard(BoardDTO boardDTO);
	
	//-----------------------------------------------------
	// [검색한 게시판 목록] 리턴하는 메소드 선언
	//-----------------------------------------------------
	List<Map<String,String>> getBoardList(BoardSearchDTO boardSearchDTO);
	
	//-----------------------------------------------------
	// [검색한 게시판 목록 개수] 리턴하는 메소드 선언
	//-----------------------------------------------------
	int getBoardListAllCnt(BoardSearchDTO boardSearchDTO);

	//-----------------------------------------------------
	// [1개 게시판 글] 리턴하는 메소드 선언
	//-----------------------------------------------------
	BoardDTO getBoardDTO(int b_no);

	//-----------------------------------------------------
	// 조회수 증가 없이 [수정/삭제 할 1개의 게시판 글 정보] 리턴하는 메소드 선언
	//-----------------------------------------------------
	BoardDTO getBoardDTO_without_upReadcount(int b_no);

	//-----------------------------------------------------
	// [1개 게시판] 수정 후 수정 적용행의 개수를 리턴하는 메소드 선언
	//-----------------------------------------------------
	int updateBoard(BoardDTO boardDTO);
	
	//-----------------------------------------------------
	// [1개 게시판] 삭제 후 삭제 적용행의 개수를 리턴하는 메소드 선언
	//-----------------------------------------------------
	int deleteBoard(BoardDTO boardDTO);

}
