package com.report.ware;

import java.util.List;
import java.util.Map;

//==============================================
// [BoardDAO 인터페이스] 선언
//==============================================
public interface BoardDAO {
	//==============================================
	// [1개 게시판 글 출력번호 수정하고 수정 행의 개수] 리턴하는 메소드 선언 
	//==============================================
	int updatePrint_no(BoardDTO boardDTO);
	
	//==============================================
	// [게시판 글 입력 후 입력 적용 행의 개수] 리턴하는 메소드 선언 
	//==============================================
	int insertBoard(BoardDTO boardDTO);
	
	//==============================================
	// [검색한 게시판 목록] 리턴하는 메소드 선언
	//==============================================
	List<Map<String,String>> getBoardList(BoardSearchDTO boardSearchDTO);

	//==============================================
	// [검색한 게시판 목록 개수] 리턴하는 메소드 선언
	//==============================================
	int getBoardListAllCnt(BoardSearchDTO boardSearchDTO);
	
	//==============================================
	// [1개 게시판 글] 리턴하는 메소드 선언
	//==============================================
	BoardDTO getBoardDTO(int b_no);
	
	//==============================================
	// [1개의 게시판 글 조회수 1 업데이트하는] 메소드 선언
	//==============================================
	int updateReadcount(int b_no);
	
	
	
	//*******************************
	// 수정 삭제 관련 메소드
	//*******************************
	

	//==============================================
	// [수정/삭제할 1개 게시판 글의 존재여부 개수] 개수 리턴하는 메소드 선언
	//==============================================
	int getBoardCnt(BoardDTO boardDTO);

	//==============================================
	// [삭제할 1개 게시판 암호 일치 개수] 개수 리턴하는 메소드 선언
	//==============================================
	int getPwdCnt(BoardDTO boardDTO);

	//==============================================
	// [1개 게시판] 수정 후 수정 적용행의 개수를 리턴하는 메소드 선언
	//==============================================
	int updateBoard(BoardDTO boardDTO);

	
	//==============================================
	// [1개 게시판 글] 삭제 후 삭제 적용행의 개수를 리턴하는 메소드 선언
	//==============================================
	int deleteBoard(BoardDTO boardDTO);

}
